In [1]:
%autosave 5

Autosaving every 5 seconds

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
emissions = pd.DataFrame({
    'country': ['China','United States','India'],
    'year': ['2018','2018','2018'],
    'co2_emissions': [10060000000.0,5410000000.0,2650000000.0]
})

In [4]:
emissions

         country  year  co2_emissions
0          China  2018   1.006000e+10
1  United States  2018   5.410000e+09
2          India  2018   2.650000e+09

In [7]:
pd.set_option('max_rows', 2)

In [8]:
emissions

   country  year  co2_emissions
0    China  2018   1.006000e+10
..     ...   ...            ...
2    India  2018   2.650000e+09

[3 rows x 3 columns]

In [12]:
pd.set_option('max_columns', 2)

In [14]:
emissions

   country  ... co2_emissions
0    China  ...  1.006000e+10
..     ...  ...           ...
2    India  ...  2.650000e+09

[3 rows x 3 columns]

In [17]:
pd.options.display.float_format = '{:,.2f}'.format

In [18]:
emissions

   country  ...     co2_emissions
0    China  ... 10,060,000,000.00
..     ...  ...               ...
2    India  ...  2,650,000,000.00

[3 rows x 3 columns]

In [20]:
planets = pd.read_csv('../Exercise Files/planets.csv')

In [21]:
planets.head()

             method  ...  year
0   Radial Velocity  ...  2006
..              ...  ...   ...
4   Radial Velocity  ...  2009

[5 rows x 6 columns]

In [23]:
planets.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [28]:
pd.set_option('max_columns', 3)
pd.set_option('max_rows', 4)

In [29]:
planets.head()

             method  ...  year
0   Radial Velocity  ...  2006
1   Radial Velocity  ...  2008
..              ...  ...   ...
3   Radial Velocity  ...  2007
4   Radial Velocity  ...  2009

[5 rows x 6 columns]

In [30]:
planets.mean()

number               1.79
orbital_period   2,002.92
                   ...
distance           264.07
year             2,009.07
Length: 5, dtype: float64

In [33]:
planets['number'][0] / planets['mass'][0]

0.14084507042253522

In [34]:
planets['number'][0].astype(float)

1.0

In [35]:
planets['mass'][0].astype(int)

7

In [36]:
planets['year'][0].astype(str)

'2006'

In [40]:
pd.to_datetime(planets['year'], format='%Y')

0      2006-01-01
1      2008-01-01
          ...
1033   2008-01-01
1034   2008-01-01
Name: year, Length: 1035, dtype: datetime64[ns]

In [44]:
emissions['country'].str.contains('United')

0    False
1     True
2    False
Name: country, dtype: bool